Repository: liraymond04/lotm-subs
Catalog: ep10/ep10-omegat/omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 0级封印物
en_us: A Grade 0 Sealed Artifact.

source: 一共二十二张
en_us: A total of twenty-two cards.

source: 一名序列六的死灵导师
en_us: A Sequence 6 Spirit Guide.

source: 一直伪装成普通廷根市民
en_us: He's been disguised as an ordinary citizen of Tingen.

source: 三年前失控了
en_us: that lost control three years ago.

source: 不像武器的武器
en_us: A weapon that's not like a weapon.

source: 不可外传
en_us: Not to be disseminated.

source: 不可打听
en_us: Not to be inquired about.

source: 不可描述
en_us: Not to be described.

source: 不可窥探
en_us: Not to be spied upon.

source: 不太像
en_us: Not exactly.

source: 不快点逃出去的话
en_us: If I don't escape quickly...

source: 不愧是廷根最有名的交际花
en_us: As expected of Tingen's most famous socialite.

source: 不朽的神性
en_us: Immortal divinity!

source: 不用心急
en_us: No need to rush.

source: 不需要墨水也能书写
en_us: It doesn't require ink to write.

source: 与“他”也有一定的关系
en_us: definitely also have a connection to "Him",

source: 与现实世界重叠
en_us: Overlapping with the real world.

source: 两人肯定关系匪浅
en_us: The two must have a close relationship.

source: 也可以直接来问我
en_us: you can also ask me directly.

source: 也排除了他杀
en_us: and also ruling out foul play,

source: 也有着不小的
en_us: There are also quite a few

source: 也没法做其他确认
en_us: There's no way to verify anything else either.

source: 也许能让对方放松警惕
en_us: perhaps can make them loosen up.

source: 也许藏在背后
en_us: may also be hidden behind it,

source: 事情也许相当严重
en_us: This situation may be rather serious.

source: 于迷雾中自由漫步手握光之杯盏
en_us: To be free in mist to hold a cup of light

source: 人类通过服食魔药
en_us: Humanity through consuming potions

source: 什么
en_us: What?

source: 什么忙
en_us: What kind of favor?

source: 什么情况
en_us: What's going on?

source: 什么意思
en_us: What's the meaning of this?

source: 今天也下来了
en_us: came in today too.

source: 今天先教你两项非凡技能
en_us: Today, I'll first teach you two Beyonder abilities.

source: 今天的知识会不会
en_us: Will today's knowledge be

source: 今早男仆发现的
en_us: The butler discovered it this morning.

source: 今晚十点左右就会来找你
en_us: Tonight at around 10 o'clock they'll come find you.

source: 从序列九开始
en_us: start from Sequence 9.

source: 他也去了贝克兰德
en_us: he also went to Backlund.

source: 他在信上说
en_us: He mentioned in the letter

source: 他将向所谓的主人
en_us: to offer his so-called God

source: 他就是我今天准备重点排查的对象
en_us: He's the one I was going to focus today's investigation on.

source: 他的梦境已经一片混乱
en_us: His dreams are already a sea of chaos.

source: 他突然疯了
en_us: he suddenly went mad.

source: 他说
en_us: He said.

source: 以后怎么办
en_us: What do we do from here on out?

source: 以后由我来教你格斗和发力技巧
en_us: From now on, I'll teach you combat and techniques for delivering force.

source: 以微弱之光
en_us: With fragile light

source: 会计基础理论
en_us: Basic Accounting Theory?

source: 会遗留一些富集超凡力量的事物
en_us: they will leave behind things that are rich with Beyonder powers.

source: 伟大的神灵
en_us: Magnificient Deity.

source: 伟大的神灵啊
en_us: O Magnificent Deity,

source: 但很遗憾
en_us: but it's a pity

source: 但我会为此付出应有的报酬
en_us: But to this end I will pay you the compensation you deserve.

source: 但我认为
en_us: But I think

source: 何处有钥匙从骨血里凿出真相
en_us: Where are the flames that come in fury?

source: 作为你的代号
en_us: It will serve as your codename.

source: 你
en_us: Do you

source: 你上次提到的那个倒立陵寝
en_us: The Inverted Maesoleum you mentioned last time

source: 你不仅会得到掌握魔药力量
en_us: You'll not only harness the power of the potion,

source: 你不会想知道答案的
en_us: You wouldn't want to know the answer.

source: 你之前申请的东西
en_us: The things you applied for earlier

source: 你们为什么不抓捕她
en_us: Why are you not arresting her?!

source: 你们继续
en_us: You may continue.

source: 你偷了我的蛋糕
en_us: You stole my cake!

source: 你喜欢这个
en_us: You liked this,

source: 你差点迷失在他的心灵世界中
en_us: You almost got lost in his Mind World.

source: 你已经序列八了
en_us: You're already Sequence 8.

source: 你应该看得出来
en_us: You should be able to see!

source: 你必须习惯
en_us: you have to get used to it.

source: 你是来看戴莉女士的吗
en_us: You're here to see Madam Daly, right?

source: 你是谁
en_us: Who are you.

source: 你来啦
en_us: You're here!

source: 你查到什么
en_us: What did you find?

source: 你现在看起来
en_us: Right now you look like

source: 你百分之一千
en_us: you'll one thousand percent

source: 你知道我要来
en_us: You knew I was coming.

source: 你管这叫小家伙
en_us: You call this a little guy?

source: 你粗陋的言语很不符合你的身份
en_us: Your vulgar words are unbecoming of your position.

source: 你试试用通灵仪式魔法
en_us: You try using a mediumship ritual.

source: 你还记得那封写给乙先生的信吗
en_us: Do you still remember that letter written to Mr. Z?

source: 你这无耻的贱人
en_us: "You shameless bitch."

source: 你这是
en_us: this is...

source: 信使
en_us: Messenger...

source: 倒吊人
en_us: The Hanged Man.

source: 偶然暴露了非凡能力
en_us: A suspected Sequence 7 Psychiatrist

source: 偷盗者途径序列八
en_us: a Marauder Pathway Sequence 8—

source: 先学习基本的数学逻辑和相关法律常识
en_us: First study basic mathematical logic and relevant legal knowledge,

source: 克莱恩
en_us: Klein,

source: 公开考试选拔人才的高考
en_us: Higher Exam for selecting talent through public examinations,

source: 兰尔乌斯
en_us: Lanevus.

source: 兰尔乌斯为什么来找你
en_us: Why did Lanevus come looking for you?

source: 兰尔乌斯想让你
en_us: What kind of help

source: 关于0-08
en_us: Regarding 0-08,

source: 关系密切
en_us: with Madam Sharon.

source: 关键时候才能够
en_us: Only at the critical moment can you

source: 其他有什么不懂的
en_us: Anything else you don't understand

source: 准度差了点
en_us: The accuracy is lacking a bit.

source: 刚刚那位信使一上来就开了大
en_us: Just recently that messenger ulted from the get-go.

source: 初步定案为疾病导致的死亡
en_us: the initial verdict is death due to sudden illness.

source: 初步的检查报告显示
en_us: The initial autopsy report shows

source: 别激动嘛
en_us: Don't get so worked up.

source: 别理他
en_us: Don't mind him.

source: 别睡早了
en_us: Don't go to bed early.

source: 前往贝克兰德
en_us: to Backlund.

source: 力量够了
en_us: The power is sufficient.

source: 单靠我一个人
en_us: relying on just myself...

source: 危险
en_us: dangers.

source: 又入梦吓人
en_us: Entering peoples' dreams to scare them {\i1}again{\i0}.

source: 又好重
en_us: Yet so heavy.

source: 又涨薪了
en_us: You got another raise!

source: 发现不要惊动立刻票报
en_us: is if you discover him, don't alert him and immediately make a report.

source: 发生什么事了
en_us: What happened?

source: 另一方面
en_us: On the other hand,

source: 只对死灵类生物有克制作用
en_us: Only has a restrictive effect on undead creatures.

source: 只知道它看起来是一支常见的羽毛笔
en_us: all I know is that it looks like a common quill pen.

source: 只要提供一点点帮助
en_us: provided you only offer a little bit of help!

source: 只要能抓住机会
en_us: So long as you can seize the opportunity

source: 召唤信使
en_us: Summoning a messenger,

source: 可以召唤出我的信使
en_us: It can summon my messenger.

source: 可以拥有比肩神明的力量
en_us: can possess power comparable to gods.

source: 可控呢
en_us: they are controllable?

source: 吃晚饭了吗
en_us: Have you had dinner?

source: 否则
en_us: Otherwise,

source: 告诉我
en_us: Tell me.

source: 周薪还在两镑以下
en_us: that I'll still be making less than two pounds a week.

source: 和一个不一样的通灵术
en_us: and a different mediumship ritual.

source: 和弗莱一致
en_us: Unanimous with Frye.

source: 和真实造物者有关
en_us: It's related to the True Creator.

source: 和真实造物者有关的话
en_us: If it's related to the True Creator

source: 和类似真实造物者的影子
en_us: And a shadow resembling the True Creator.

source: 和雪伦夫人之间
en_us: They have a close relationship

source: 哪儿多了
en_us: How's it too much?

source: 器工
en_us: Bring your weapons,

source: 回家
en_us: go home.

source: 回来啦克莱恩
en_us: You're back, Klein.

source: 因为人本身意志的存在
en_us: the existence of the human will

source: 圣堂严令
en_us: The Holy Church's order

source: 在做什么
en_us: What are you doing?

source: 在心灵世界
en_us: In the Mind World,

source: 在排查兰尔乌斯案相关线索的时候
en_us: When I was searching for clues related to the Lanevus case,

source: 在虚无中刻下我未竟的名章
en_us: Into the dark to dream and scream my name

source: 在贝克兰德
en_us: In Backlund,

source: 坏了
en_us: It's broken.

source: 坠入黑暗且让梦与呐喊
en_us: Where are the keys that carve truth from me?

source: 埃尔
en_us: El.

source: 埃尔说
en_us: El said.

source: 塔罗牌
en_us: Tarot cards.

source: 太多了点
en_us: a bit too much?

source: 太巧了吧
en_us: It's too coincidental, isn't it?

source: 太阳
en_us: The Sun!

source: 奉献廷根市的全部羔羊
en_us: all the lambs in Tingen.

source: 女士
en_us: Madam.

source: 女士你这就只能算平A了
en_us: Madam, what you did just now can only be considered a basic attack.

source: 她是杀人凶手
en_us: She's the murderer!

source: 她是非常厉害的非凡者
en_us: She's a very powerful Beyonder.

source: 她用的是假名
en_us: She's using a pseudonym.

source: 好
en_us: Okay.

source: 好像是
en_us: It seems to be

source: 好轻
en_us: So light.

source: 如果不可控
en_us: If they cannot be controlled,

source: 如果幕后黑手有行动
en_us: If the black hand behind the curtain moves again,

source: 存在
en_us: They exist!

source: 存在超凡因素的影响
en_us: The existence of supernatural influences.

source: 学习
en_us: to study.

source: 完成生命层次的晋升
en_us: completing their promotion to life's natural order.

source: 实控者
en_us: The one really in charge

source: 对了
en_us: Right!

source: 对吗
en_us: right?

source: 对学习会计有帮助
en_us: it's helpful for studying accounting.

source: 对漫长历史感兴趣的
en_us: interested in the long history of this world,

source: 封印物0-08是
en_us: Sealed Artifact 0-08 is...

source: 尊敬的愚者先生
en_us: Honorable Mr. Fool.

source: 小家伙很快就会出来的
en_us: and the little guy will come out quickly.

source: 就会进入正式的实施阶段
en_us: to enter the official implementation phase.

source: 就必须被封印
en_us: they have to be sealed.

source: 就是传说中的神弃之地
en_us: it is the legendary Forsaken Land of the Gods.

source: 就是看着很催眠
en_us: It only looks very hypnotic.

source: 就该受到苦刑梨惩罚
en_us: deserve to be punished with a pear of anguish!

source: 尸体没有被移动过
en_us: The corpse has not been moved.

source: 尼尔先生
en_us: Mr. Neil.

source: 巨人语
en_us: Jotun!

source: 已经吃过了
en_us: I already ate,

source: 已经得到了国王和首相的认同
en_us: has already obtained the approval of both the King and the Prime Minister.

source: 市长候选人
en_us: mayoral candidate.

source: 带着封印物0-08潜逃
en_us: He took Sealed Artifact 0-08 and vanished.

source: 帮助
en_us: Help...

source: 幕后之人毫无动静
en_us: the person behind the curtain has made no moves.

source: 序列数字越低
en_us: The lower the Sequence number,

source: 应该更多地
en_us: You should have more

source: 廷根市名媛
en_us: A famous socialite in Tingen.

source: 廷根市议员
en_us: Tingen Member of Parliament,

source: 开始吧
en_us: Let's start,

source: 当你看到这封信的时候
en_us: by the time you see this letter

source: 当然
en_us: Without a doubt.

source: 很可能也是非凡者
en_us: It's very likely that he's also a Beyonder.

source: 很大可能同极光会也有关
en_us: then it's very likely also related to the Aurora Order.

source: 很好
en_us: Very good.

source: 心理
en_us: Psychology

source: 心理医生属于观众途径
en_us: Psychiatrists are part of the Spectator Pathway.

source: 心理炼金会
en_us: Psychology Alchemists!

source: 快去
en_us: Go!

source: 怎么了
en_us: What's up.

source: 怎么突然想到要用塔罗牌当武器
en_us: Why'd you suddenly think to use tarot cards as a weapon?

source: 恭喜你晋升序列六
en_us: Congratulations on your promotion to Sequence 6.

source: 您
en_us: Your Grace,

source: 您之前提到的那个
en_us: Your aforementioned

source: 惊叹抑或惶惑
en_us: Wonder or dismay

source: 愚者
en_us: The Fool.

source: 愚者先生
en_us: Mr. Fool.

source: 我不是神灵
en_us: I am not God.

source: 我也有一事想请教
en_us: I also have a matter I'd like to consult you about.

source: 我们上楼看看
en_us: Let's go upstairs and take a look.

source: 我们也能成为世界的掌控者
en_us: we can also become the rulers of this world!

source: 我们必须重新调查兰尔乌斯
en_us: We must re-investigate Lanevus.

source: 我们的调查被干扰了
en_us: Our investigation was interfered with.

source: 我会努力的
en_us: I'll work hard

source: 我发现了兰尔乌斯所租赁的南区钢铁工厂
en_us: I discovered that Lanevus leased the South Borough Steel Factory.

source: 我发誓守护我所留存的世界
en_us: I vow to guard a world I stay

source: 我只是 一个
en_us: I am merely someone

source: 我可不希望再过五年
en_us: I really don't hope in another five years

source: 我可没答应你
en_us: {\i1}I{\i0} never promised you that.

source: 我在
en_us: I've been

source: 我已经踏上火车
en_us: I'll have already boarded the train

source: 我并没能想起更多
en_us: that I can't remember any more.

source: 我想请你帮 一个忙
en_us: I would like to ask you for a favor.

source: 我愿意将我的生命奉献给您
en_us: I am willing to dedicate my life to you.

source: 我愿用我的鲜血取悦您
en_us: I am willing to use my blood to please you.

source: 我打算去其他地方走走
en_us: I intend to take a look around elsewhere.

source: 我提供了帮助
en_us: I provided help...

source: 我明白
en_us: I understand.

source: 我有一个好消息要分享
en_us: I have some good news to share.

source: 我有熟悉的感觉
en_us: feels familiar to me,

source: 我没警示过你吗
en_us: Did I not warn you?

source: 我的背后有哪位存在
en_us: What the presence is behind me.

source: 我看到了一个阴森的祭台
en_us: I saw a gloomy altar.

source: 我祈求女神的眷顾
en_us: I pray for the Goddess' loving grace.

source: 我祈求您
en_us: I pray that you'll

source: 我祈求隐秘的力量
en_us: I pray for the power of the mysterious.

source: 我祈求黑夜的力量
en_us: I pray for the power of the Evernight.

source: 我离开廷根
en_us: My leaving Tingen

source: 我给你找了位老师
en_us: I've found a teacher for you.

source: 我要控告你们警察渎职
en_us: I'm going to sue you police for dereliction of duty!

source: 我要控告她
en_us: I'm going to sue her!

source: 我认为这和兰尔乌斯谋划的事情
en_us: I think this is something that Lanevus planned.

source: 我让
en_us: I let...

source: 我还以为能吓你一大跳呢
en_us: I thought I'd be able to give you a big scare.

source: 我还是更喜欢通灵者这个称呼
en_us: I still prefer the name Spirit Medium.

source: 我选
en_us: I choose

source: 或者
en_us: Or.

source: 或者在任务中牺牲
en_us: or sacrifice during a mission.

source: 戴莉女士
en_us: Madam Daly!

source: 所以
en_us: So,

source: 所以会相当麻烦
en_us: So it can be quite troublesome.

source: 所有的
en_us: everything...

source: 才六张而已
en_us: There are just six!

source: 打断你的授课了
en_us: I interrupted your lesson.

source: 找一个人的下落
en_us: find the whereabouts of a person.

source: 找个相对安全的地方
en_us: Find a relatively safe place,

source: 抗拒着没有保护的灵与灵之间的沟通
en_us: resists unprotected communication between souls.

source: 抱歉
en_us: Sorry.

source: 抱歉戴莉
en_us: Sorry, Daly.

source: 指引我阴影之路
en_us: Guide my shadow way

source: 振作起来
en_us: Pull yourself together.

source: 掌握不同的非凡能力
en_us: harnessed various Beyonder abilities,

source: 排除超凡因素的影响
en_us: Ruling out the influence of supernatural factors,

source: 探索深藏在潜意识下的记忆
en_us: and explore memories hidden deep in the subconscious.

source: 接触灵界相关的知识
en_us: knowledge about contact with the spiritual world.

source: 提供什么样的帮助
en_us: does Lanevus want you to provide?

source: 搅动还是迟疑
en_us: Stiring or delay

source: 政治能量不小啊
en_us: has quite a bit of political influence.

source: 新党成员
en_us: New Party member.

source: 新的祈求
en_us: a new prayer.

source: 旁边的是现任霍伊男爵
en_us: Beside her is the incumbent Baron Khoy.

source: 无数的信息在这里流淌
en_us: Innumerable information flows here.

source: 无法再进行梦魔审问
en_us: It's no longer possible to conduct an interrogation with Nightmare.

source: 无法占卜
en_us: I can't divine it.

source: 无论是值夜者
en_us: Whether it's a Nighthawk

source: 是一名德高望重的议员
en_us: is a highly respected Member of Parliament.

source: 是人和卷毛狒狒最大的区别
en_us: That's the biggest difference between humans and curly-haired baboons!

source: 是你
en_us: It's you.

source: 是否
en_us: Whether

source: 是它
en_us: It's them.

source: 是对我有意见吗
en_us: have any problems with me?

source: 是神灵吗
en_us: are you God?

source: 是问错了问题
en_us: Did I ask the wrong question,

source: 晚上不睡觉给我蛋糕
en_us: He'd give me cake if I didn't sleep at night.

source: 暗灰低语
en_us: With whispers in grey

source: 最近
en_us: Recently,

source: 最近在警察部转为了专职
en_us: I recently transitioned to a full-time role in the police department.

source: 最高保密等级
en_us: The highest confidentiality.

source: 最高危险等级
en_us: The highest danger grade.

source: 有个突发任务
en_us: there's an urgent mission.

source: 有你的信
en_us: there's a letter for you.

source: 有很大的关联
en_us: There's a deep connection.

source: 有较强的心理防御机制
en_us: They have strong psychological defense mechanisms.

source: 机械之心
en_us: Machinery Hivemind;

source: 来廷根有什么目的
en_us: What is their purpose in coming to Tingen?

source: 来自哪个组织
en_us: What organization are you from?

source: 极光会
en_us: Aurora Order.

source: 极光会一直在追寻真实造物者的圣所
en_us: The Aurora Order has continuously been pursuing the holy residence of the True Creator.

source: 极光会成员西里斯身上的信
en_us: The letter Aurora Order member Sirius carried.

source: 果然
en_us: As expected.

source: 果然你就是那位死灵导师
en_us: As expected, you are the Spirit Guide.

source: 果然知识就是财富
en_us: As expected, knowledge is wealth.

source: 梅丽莎
en_us: Melissa.

source: 梅纳德议员夫人怒吼
en_us: Member of Parliament Mrs. Maynard bellowed,

source: 梦魔
en_us: Nightmare.

source: 欧根也不清楚
en_us: is Eugen also unsure?

source: 欧根的心灵海洋已经崩塌了
en_us: Eugen's spiritual sea has already collapsed.

source: 欧根连疯了都记着他的蛋糕
en_us: Eugen remembers his cake even he's he's gone mad.

source: 正义
en_us: Justice.

source: 正义小姐
en_us: Miss Justice.

source: 此进化路径称为
en_us: This path of evolution is called

source: 死亡时间在昨晚九点到十一点之间
en_us: that the time of death was between nine and eleven last night.

source: 死亡时间太巧合了
en_us: The time of death is too coincidental.

source: 殉职
en_us: die in the line of duty.

source: 毁灭日降临
en_us: at the arrival of the end of days,

source: 没声音
en_us: No sound.

source: 没有
en_us: He didn't.

source: 没有啊
en_us: I haven't.

source: 没有回应
en_us: No response.

source: 没有蛋糕
en_us: There's no cake.

source: 海盗七将军
en_us: Seven Pirate Admirals.

source: 海盗七将军之
en_us: One of the Seven Pirate Admirals,

source: 深入调查一下雪伦夫人关系网
en_us: Investigate deeper into Madam Sharon's social network.

source: 渐行渐远
en_us: Fade away

source: 炼金会
en_us: Alchemists.

source: 焚毁破碎躯壳铸就新视野
en_us: Burn my broken shell to new sight

source: 牌比枪更隐蔽
en_us: Cards are more covert than guns.

source: 牌面镶有纯银等金属丝
en_us: The card faces are inlaid with pure silver and other metal threads.

source: 现在还有哪个地方是用巨人语的
en_us: Where in the world is Jotun still used?

source: 班森
en_us: Benson,

source: 甜冰茶
en_us: sweet iced tea.

source: 用仪式魔法
en_us: Using ritualistic magic,

source: 用力吹一下吧
en_us: use some force and give it a blow,

source: 疑似序列七的心理医生
en_us: who accidentally exposed his Beyonder abilities.

source: 癫狂还是腐朽
en_us: Madness or Decay

source: 看来正义小姐的家族
en_us: It seems that Miss Justice's family

source: 看来这些天魔药消化得很顺利呀
en_us: It looks like the potion digestion has been going smoothly these past few days.

source: 看看她与兰尔乌斯有没有关联
en_us: See if she has any connections to Lanevus.

source: 看能不能找回更多记忆
en_us: To see if I can find more memories.

source: 真实信息不足
en_us: There's not enough genuine information.

source: 真的
en_us: Really.

source: 真的是巨人语
en_us: It really is Jotun!

source: 睡了吗
en_us: Have you slept?

source: 神之途径
en_us: the Path of the Divine.

source: 神奇生物保护协会
en_us: the Society for the Protection of Fantastic Organisms!

source: 神弃之地
en_us: Forsaken Land of the Gods.

source: 笔
en_us: Pen?

source: 等你
en_us: waiting for you.

source: 等到时机合适
en_us: that he was waiting for an appropriate opportunity,

source: 精神好些了
en_us: you're in better spirits.

source: 糟
en_us: Shit!

source: 红酒大餐
en_us: red wine and a banquet.

source: 约翰·梅纳德
en_us: John Maynard.

source: 约翰·梅纳德的死亡
en_us: The death of John Maynard.

source: 绝杀反击
en_us: deliver a fatal counter-attack.

source: 继子
en_us: Stepson?

source: 罗塞尔大帝寻找神弃之地干什么
en_us: What was Emperor Roselle looking for in the Forsaken Land of the Gods?

source: 而心理炼金会
en_us: And the Psychology Alchemists

source: 而心理炼金会从某种意义上来说
en_us: And in some sense, the Psychology Alchemists

source: 肯定和超凡因素有关
en_us: It's definitely related to supernatural factors.

source: 背后有隐藏的利益输送
en_us: There's a hidden exchange of interests behind this.

source: 胡德·欧根
en_us: Hood Eugen.

source: 至今未被发现
en_us: To this day he has yet to be discovered.

source: 被遗弃的地方
en_us: A land that was forsaken.

source: 要小心
en_us: Exercise caution.

source: 让你们担心了
en_us: I made you worry.

source: 让我与胡德·欧根的灵性沟通
en_us: allow me to communicate with Hood Eugen's spirituality.

source: 议员夫人
en_us: Mrs. Member of Parliament.

source: 记得你答应我的
en_us: Remember you promised me

source: 诈骗师
en_us: —Swindler?

source: 诈骗师特有的说话风格
en_us: A Swindler's characteristic style of speaking!

source: 诈骗犯
en_us: Swindler.

source: 该振作了
en_us: I should pull myself together.

source: 说好给我带的蛋糕呢
en_us: You said you'd bring me a cake.

source: 说起来
en_us: Speaking of which,

source: 请原谅我的微小越
en_us: Please forgive me for overstepping my boundaries.

source: 请将太阳和光重新赐予这个被您遗弃的地方
en_us: Please bestow the sun and light once more upon this land that you have forsaken.

source: 请让我们这些黑暗之民摆脱那宿命的诅咒
en_us: Please allow us, the People of the Dark, be freed from the curse of our destiny.

source: 请问找谁
en_us: May I ask who to look for?

source: 谢谢
en_us: Thank you.

source: 过去现在与未来在这里交汇
en_us: The past, present, and future converge here.

source: 还不赶紧拿去倒掉
en_us: hurry up and throw that out!

source: 还好我学过一点
en_us: Fortunately I've learned a bit.

source: 还是代罚者
en_us: or a Mandated Punisher,

source: 还是说
en_us: or

source: 还有幕后黑手要查
en_us: There's still a black hand behind the curtain to investigate.

source: 还能获得非凡者梦寐以求的神性
en_us: You'll also get the divinity that Beyonders have always dreamed of.

source: 还要
en_us: I still need to

source: 这不是你现在该知道的事情
en_us: This is not something you should know now.

source: 这个
en_us: This.

source: 这么快
en_us: So fast.

source: 这二十二条进阶之路
en_us: These twenty-two paths of advancement

source: 这件事
en_us: This matter

source: 这位议员之死没那么简单
en_us: the death of this Member of Parliament is not so simple.

source: 这几人都是保守党和新党议员
en_us: These people are all members of the Conservative Party and the New Party.

source: 这就是封印物的来源之一
en_us: This is one of the origins of Sealed Artifacts.

source: 这就是戴莉女士所说的灵界
en_us: This is the Spirit World Madam Daly spoke of.

source: 这就是通往胡德欧根心灵世界的入口
en_us: This leads to the entrance of Hood Eugen's Mind World.

source: 这张通缉令是
en_us: This wanted order is―—

source: 这是
en_us: This is...

source: 这是一名大主教
en_us: This is an archbishop

source: 这是什么声音
en_us: What sound is this?

source: 这是什么语言
en_us: What language is this?

source: 这是我第几次被干扰了
en_us: How many times have I been interfered with now?

source: 这枚铜哨是我苏醒时随身携带的物品
en_us: This copper whistle was something I had with me when I woke up.

source: 这次的发票是不是太多了点儿
en_us: Aren't the invoices this time a little too much?

source: 这种荡妇婊子
en_us: These kinds of slutty whores

source: 这都是以千年为单位计算的老古董了
en_us: This is an ancient antique that is thousands of years old.

source: 进入对方的心灵世界
en_us: you can enter another person's Mind World,

source: 选一张吧
en_us: Choose a card, then.

source: 通常
en_us: Usually,

source: 避免失控的办法
en_us: but also the method to avoid losing control!

source: 那不如就叫
en_us: Then it'd be better to just call it

source: 那个骗财又骗色的诈骗犯
en_us: That criminal who cheated both money and sex.

source: 那埃尔是谁
en_us: Then who is El?

source: 那如果
en_us: Then what if

source: 那是我疏忽了
en_us: Then that's my oversight.

source: 都会面临失控
en_us: they all will face losing control

source: 重生抑或如故
en_us: Rebirth or be same

source: 队长
en_us: Captain.

source: 队长的梦魔能力增强了
en_us: The Captain's Nightmare ability has been enhanced.

source: 队长说得对
en_us: The Captain is right.

source: 阴森的祭台
en_us: A gloomy altar.

source: 阿兹克先生
en_us: Mr. Azik.

source: 阿兹克先生也离开了
en_us: Mr. Azik has left too.

source: 随手买的
en_us: I happened to buy some

source: 难怪欧根直接失控
en_us: No wonder Eugen immediately lost control.

source: 难道
en_us: Could it be that

source: 难道是在展现神迹
en_us: Could it be that he's performing a miracle?

source: 难道是资料上所说的
en_us: Could it be he's what the files referred to as

source: 雪伦夫人
en_us: Madam Sharon.

source: 雪伦夫人与兰尔乌斯有关联
en_us: Madam Sharon and Lanevus are connected.

source: 雪伦夫人和幕后黑手有关
en_us: Madam Sharon is related to the black hand behind the curtain?

source: 雪伦夫人昨晚是我派来见梅纳德议员的
en_us: I sent Madam Sharon to meet with Member of Parliament Maynard last night.

source: 雪伦夫人是议员生前见的最后一个人
en_us: Madam Sharon was the last person the Member of Parliament met while he was alive.

source: 雪伦夫人是非凡者
en_us: Madam Sharon is a Beyonder.
